<EOF> 0
<EOS> 1
<UNK> 2
<S> 3
</S> 4
7 5
20 6
40 7
6 8
26 9
29 10
21 11
35 12
33 13
9 14
65 15
212 16
15 17
254 18
93 19
129 20
103 21
44 22
228 23
562 24
22 25
42 26
28 27
100 28
13 29
181 30
99 31
559 32
166 33
109 34
461 35
120 36
240 37
47 38
23 39
144 40
108 41
619 42
582 43
43 44
276 45
165 46
163 47
12 48
77 49
174 50
74 51
64 52
388 53
119 54
81 55
546 56
452 57
98 58
407 59
382 60
332 61
316 62
299 63
154 64
399 65
357 66
348 67
158 68
137 69
92 70
68 71
124 72
105 73
94 74
53 75
436 76
406 77
191 78
167 79
135 80
115 81
61 82
544 83
457 84
273 85
258 86
175 87
148 88
123 89
79 90
539 91
503 92
427 93
418 94
321 95
32 96
314 97
308 98
305 99
117 100
958 101
628 102
580 103
545 104
270 105
233 106
232 107
229 108
226 109
222 110
211 111
180 112
949 113
747 114
668 115
659 116
631 117
579 118
561 119
515 120
493 121
375 122
368 123
361 124
340 125
279 126
27 127
260 128
24 129
223 130
138 131
126 132
973 133
952 134
950 135
95 136
948 137
849 138
80 139
720 140
72 141
71 142
708 143
67 144
666 145
641 146
572 147
571 148
570 149
567 150
566 151
560 152
553 153
54 154
52 155
499 156
410 157
371 158
365 159
329 160
320 161
315 162
304 163
302 164
265 165
234 166
189 167
102 168
923 169
816 170
814 171
784 172
773 173
767 174
753 175
736 176
719 177
682 178
646 179
602 180
599 181
587 182
583 183
581 184
573 185
564 186
563 187
532 188
519 189
507 190
476 191
475 192
455 193
433 194
363 195
353 196
352 197
331 198
323 199
301 200
297 201
271 202
269 203
263 204
25 205
215 206
208 207
206 208
200 209
184 210
169 211
153 212
127 213
113 214
101 215
957 216
929 217
921 218
883 219
872 220
867 221
855 222
85 223
831 224
812 225
811 226
810 227
797 228
796 229
783 230
78 231
76 232
740 233
711 234
698 235
697 236
69 237
680 238
662 239
661 240
640 241
639 242
638 243
636 244
63 245
627 246
610 247
609 248
605 249
601 250
593 251
591 252
569 253
554 254
552 255
55 256
518 257
514 258
511 259
510 260
506 261
505 262
502 263
497 264
469 265
468 266
465 267
449 268
445 269
431 270
429 271
425 272
415 273
414 274
409 275
402 276
400 277
39 278
389 279
385 280
373 281
34 282
328 283
31 284
295 285
277 286
267 287
264 288
241 289
238 290
217 291
19 292
187 293
182 294
179 295
177 296
155 297
145 298
139 299
132 300
114 301
977 302
965 303
964 304
963 305
962 306
961 307
960 308
954 309
941 310
932 311
930 312
928 313
925 314
920 315
906 316
903 317
897 318
893 319
89 320
881 321
88 322
878 323
877 324
876 325
870 326
868 327
854 328
845 329
84 330
834 331
83 332
824 333
823 334
813 335
805 336
800 337
8 338
794 339
787 340
779 341
768 342
763 343
754 344
750 345
748 346
742 347
735 348
734 349
733 350
731 351
730 352
729 353
727 354
725 355
721 356
716 357
705 358
704 359
703 360
692 361
688 362
686 363
685 364
683 365
681 366
678 367
675 368
665 369
663 370
66 371
653 372
652 373
651 374
650 375
643 376
635 377
622 378
617 379
607 380
606 381
600 382
589 383
588 384
585 385
578 386
574 387
568 388
565 389
558 390
556 391
555 392
551 393
548 394
536 395
530 396
521 397
516 398
509 399
508 400
501 401
496 402
485 403
484 404
479 405
478 406
472 407
470 408
467 409
458 410
456 411
451 412
443 413
441 414
435 415
430 416
420 417
419 418
417 419
416 420
413 421
41 422
408 423
405 424
398 425
392 426
391 427
390 428
378 429
376 430
372 431
370 432
364 433
360 434
359 435
358 436
351 437
346 438
342 439
338 440
337 441
333 442
326 443
322 444
318 445
317 446
313 447
312 448
307 449
286 450
256 451
255 452
247 453
245 454
242 455
236 456
225 457
214 458
210 459
209 460
202 461
199 462
196 463
194 464
188 465
178 466
172 467
170 468
161 469
159 470
156 471
152 472
146 473
143 474
136 475
130 476
1082 477
107 478
106 479
1059 480
1040 481
104 482
1014 483
1012 484
999 485
998 486
997 487
996 488
995 489
994 490
993 491
992 492
991 493
990 494
989 495
988 496
987 497
986 498
985 499
984 500
983 501
982 502
981 503
980 504
979 505
978 506
976 507
975 508
974 509
972 510
971 511
970 512
97 513
969 514
968 515
967 516
966 517
96 518
959 519
956 520
955 521
953 522
951 523
947 524
946 525
945 526
944 527
943 528
942 529
940 530
939 531
938 532
937 533
936 534
935 535
934 536
933 537
931 538
927 539
926 540
924 541
922 542
919 543
918 544
917 545
916 546
915 547
914 548
913 549
912 550
911 551
910 552
91 553
909 554
908 555
907 556
905 557
904 558
902 559
901 560
900 561
90 562
899 563
898 564
896 565
895 566
894 567
892 568
891 569
890 570
889 571
888 572
887 573
886 574
885 575
884 576
882 577
880 578
879 579
875 580
874 581
873 582
871 583
87 584
869 585
866 586
865 587
864 588
863 589
862 590
861 591
860 592
86 593
859 594
858 595
857 596
856 597
853 598
852 599
851 600
850 601
848 602
847 603
846 604
844 605
843 606
842 607
841 608
840 609
839 610
838 611
837 612
836 613
835 614
833 615
832 616
830 617
829 618
828 619
827 620
826 621
825 622
822 623
821 624
820 625
82 626
819 627
818 628
817 629
815 630
809 631
808 632
807 633
806 634
804 635
803 636
802 637
801 638
799 639
798 640
795 641
793 642
792 643
791 644
790 645
789 646
788 647
786 648
785 649
782 650
781 651
780 652
778 653
777 654
776 655
775 656
774 657
772 658
771 659
770 660
769 661
766 662
765 663
764 664
762 665
761 666
760 667
759 668
758 669
757 670
756 671
755 672
752 673
751 674
75 675
749 676
746 677
745 678
744 679
743 680
741 681
739 682
738 683
737 684
732 685
73 686
728 687
726 688
724 689
723 690
722 691
718 692
717 693
715 694
714 695
713 696
712 697
710 698
709 699
707 700
706 701
702 702
701 703
700 704
70 705
699 706
696 707
695 708
694 709
693 710
691 711
690 712
689 713
687 714
684 715
679 716
677 717
676 718
674 719
673 720
672 721
671 722
670 723
669 724
667 725
664 726
660 727
658 728
657 729
656 730
655 731
654 732
649 733
648 734
647 735
645 736
644 737
642 738
637 739
634 740
633 741
632 742
630 743
629 744
626 745
625 746
624 747
623 748
621 749
620 750
62 751
618 752
616 753
615 754
614 755
613 756
612 757
611 758
608 759
604 760
603 761
60 762
598 763
597 764
596 765
595 766
594 767
592 768
590 769
59 770
586 771
584 772
58 773
577 774
576 775
575 776
57 777
56 778
557 779
550 780
549 781
547 782
543 783
542 784
541 785
540 786
538 787
537 788
535 789
534 790
533 791
531 792
529 793
528 794
527 795
526 796
525 797
524 798
523 799
522 800
520 801
517 802
513 803
512 804
51 805
504 806
500 807
50 808
5 809
498 810
495 811
494 812
492 813
491 814
490 815
49 816
489 817
488 818
487 819
486 820
483 821
482 822
481 823
480 824
48 825
477 826
474 827
473 828
471 829
466 830
464 831
463 832
462 833
460 834
46 835
459 836
454 837
453 838
450 839
45 840
448 841
447 842
446 843
444 844
442 845
440 846
439 847
438 848
437 849
434 850
432 851
428 852
426 853
424 854
423 855
422 856
421 857
412 858
411 859
404 860
403 861
401 862
397 863
396 864
395 865
394 866
393 867
387 868
386 869
384 870
383 871
381 872
380 873
38 874
379 875
377 876
374 877
37 878
369 879
367 880
366 881
362 882
36 883
356 884
355 885
354 886
350 887
349 888
347 889
345 890
344 891
343 892
341 893
339 894
336 895
335 896
334 897
330 898
327 899
325 900
324 901
319 902
311 903
310 904
309 905
306 906
303 907
300 908
30 909
298 910
296 911
294 912
293 913
292 914
291 915
290 916
289 917
288 918
287 919
285 920
284 921
283 922
282 923
281 924
280 925
278 926
275 927
274 928
272 929
268 930
266 931
262 932
261 933
259 934
257 935
253 936
252 937
251 938
250 939
249 940
248 941
246 942
244 943
243 944
239 945
237 946
235 947
231 948
230 949
227 950
224 951
221 952
220 953
219 954
218 955
216 956
213 957
207 958
205 959
204 960
203 961
201 962
198 963
197 964
195 965
193 966
192 967
190 968
186 969
185 970
183 971
18 972
176 973
173 974
171 975
17 976
168 977
164 978
162 979
160 980
16 981
157 982
151 983
150 984
149 985
147 986
142 987
141 988
140 989
14 990
134 991
133 992
131 993
128 994
125 995
122 996
121 997
118 998
116 999
112 1000
111 1001
1109 1002
1108 1003
1107 1004
1106 1005
1105 1006
1104 1007
1103 1008
1102 1009
1101 1010
1100 1011
110 1012
11 1013
1099 1014
1098 1015
1097 1016
1096 1017
1095 1018
1094 1019
1093 1020
1092 1021
1091 1022
1090 1023
1089 1024
1088 1025
1087 1026
1086 1027
1085 1028
1084 1029
1083 1030
1081 1031
1080 1032
1079 1033
1078 1034
1077 1035
1076 1036
1075 1037
1074 1038
1073 1039
1072 1040
1071 1041
1070 1042
1069 1043
1068 1044
1067 1045
1066 1046
1065 1047
1064 1048
1063 1049
1062 1050
1061 1051
1060 1052
1058 1053
1057 1054
1056 1055
1055 1056
1054 1057
1053 1058
1052 1059
1051 1060
1050 1061
1049 1062
1048 1063
1047 1064
1046 1065
1045 1066
1044 1067
1043 1068
1042 1069
1041 1070
1039 1071
1038 1072
1037 1073
1036 1074
1035 1075
1034 1076
1033 1077
1032 1078
1031 1079
1030 1080
1029 1081
1028 1082
1027 1083
1026 1084
1025 1085
1024 1086
1023 1087
1022 1088
1021 1089
1020 1090
1019 1091
1018 1092
1017 1093
1016 1094
1015 1095
1013 1096
1011 1097
1010 1098
1009 1099
1008 1100
1007 1101
1006 1102
1005 1103
1004 1104
1003 1105
1002 1106
1001 1107
1000 1108
10 1109
