<EOF> 0
<EOS> 1
<UNK> 2
<S> 3
</S> 4
1109 1109
1108 1108
1105 1105
1104 1104
1101 1101
1097 1097
1094 1094
1093 1093
1091 1091
1090 1090
1089 1089
1087 1087
1086 1086
1082 1082
1078 1078
1077 1077
1076 1076
1074 1074
1073 1073
1071 1071
1070 1070
1067 1067
1065 1065
1063 1063
1062 1062
1061 1061
1060 1060
1059 1059
1058 1058
1053 1053
1052 1052
1051 1051
1050 1050
1049 1049
1048 1048
1047 1047
1046 1046
1044 1044
1043 1043
1042 1042
1041 1041
1040 1040
1038 1038
1034 1034
1031 1031
1030 1030
1098 1098
1028 1028
1026 1026
1024 1024
1023 1023
1022 1022
1021 1021
1100 1100
1018 1018
1015 1015
1014 1014
1011 1011
1080 1080
1010 1010
1017 1017
1009 1009
1008 1008
1007 1007
1006 1006
1005 1005
1004 1004
1000 1000
999 999
998 998
997 997
992 992
988 988
984 984
983 983
982 982
979 979
976 976
971 971
968 968
967 967
965 965
964 964
958 958
957 957
955 955
954 954
953 953
951 951
950 950
1025 1025
947 947
946 946
942 942
936 936
935 935
932 932
931 931
928 928
926 926
925 925
924 924
920 920
919 919
918 918
917 917
916 916
914 914
913 913
912 912
911 911
1055 1055
910 910
906 906
904 904
941 941
903 903
901 901
899 899
898 898
896 896
894 894
893 893
892 892
891 891
890 890
888 888
887 887
886 886
883 883
881 881
876 876
875 875
1106 1106
873 873
872 872
870 870
868 868
1033 1033
994 994
866 866
938 938
865 865
862 862
856 856
855 855
854 854
853 853
991 991
851 851
843 843
842 842
840 840
838 838
837 837
836 836
835 835
834 834
833 833
832 832
831 831
826 826
824 824
822 822
820 820
819 819
817 817
816 816
815 815
814 814
812 812
1066 1066
810 810
940 940
808 808
807 807
806 806
805 805
626 626
797 797
937 937
719 719
794 794
792 792
791 791
157 157
789 789
907 907
753 753
788 788
62 62
375 375
549 549
786 786
782 782
776 776
778 778
771 771
768 768
202 202
764 764
961 961
655 655
774 774
693 693
754 754
959 959
736 736
752 752
747 747
745 745
401 401
744 744
743 743
746 746
742 742
425 425
740 740
989 989
739 739
978 978
738 738
737 737
735 735
230 230
732 732
960 960
730 730
477 477
725 725
723 723
769 769
720 720
717 717
939 939
716 716
713 713
921 921
733 733
358 358
711 711
645 645
760 760
637 637
708 708
706 706
159 159
705 705
240 240
704 704
701 701
93 93
391 391
728 728
700 700
699 699
981 981
697 697
377 377
695 695
271 271
691 691
909 909
78 78
462 462
687 687
266 266
686 686
970 970
593 593
683 683
1064 1064
682 682
681 681
181 181
678 678
677 677
1056 1056
644 644
674 674
536 536
669 669
874 874
665 665
662 662
659 659
648 648
658 658
654 654
281 281
653 653
145 145
652 652
646 646
785 785
640 640
381 381
770 770
639 639
634 634
630 630
541 541
628 628
963 963
763 763
1054 1054
627 627
845 845
767 767
479 479
625 625
624 624
623 623
619 619
987 987
615 615
1068 1068
613 613
849 849
610 610
825 825
801 801
643 643
254 254
608 608
605 605
673 673
564 564
604 604
1072 1072
600 600
599 599
598 598
591 591
590 590
589 589
612 612
235 235
348 348
584 584
146 146
581 581
580 580
578 578
900 900
577 577
775 775
796 796
576 576
509 509
722 722
416 416
575 575
573 573
848 848
572 572
571 571
861 861
31 31
570 570
727 727
188 188
569 569
567 567
115 115
565 565
1035 1035
563 563
560 560
559 559
347 347
558 558
557 557
550 550
548 548
84 84
546 546
545 545
1084 1084
232 232
544 544
165 165
542 542
540 540
537 537
547 547
1088 1088
534 534
299 299
531 531
830 830
191 191
523 523
519 519
521 521
781 781
389 389
520 520
515 515
518 518
943 943
390 390
772 772
694 694
635 635
513 513
343 343
511 511
298 298
508 508
15 15
506 506
504 504
503 503
501 501
818 818
809 809
500 500
828 828
499 499
498 498
496 496
880 880
204 204
494 494
766 766
490 490
488 488
1075 1075
336 336
487 487
486 486
609 609
132 132
582 582
1020 1020
484 484
483 483
596 596
480 480
485 485
863 863
478 478
234 234
476 476
539 539
877 877
12 12
475 475
852 852
474 474
473 473
470 470
1103 1103
617 617
467 467
800 800
603 603
466 466
948 948
552 552
461 461
765 765
915 915
696 696
118 118
668 668
458 458
551 551
287 287
312 312
457 457
456 456
841 841
455 455
1019 1019
449 449
1107 1107
447 447
442 442
22 22
440 440
620 620
436 436
493 493
1057 1057
435 435
432 432
882 882
428 428
427 427
846 846
251 251
734 734
426 426
680 680
423 423
422 422
1032 1032
492 492
554 554
956 956
99 99
421 421
1079 1079
419 419
284 284
418 418
424 424
415 415
756 756
162 162
450 450
636 636
414 414
526 526
413 413
463 463
445 445
409 409
406 406
405 405
404 404
688 688
777 777
403 403
101 101
39 39
60 60
398 398
313 313
396 396
698 698
667 667
42 42
629 629
341 341
155 155
395 395
972 972
394 394
707 707
586 586
393 393
283 283
384 384
73 73
48 48
369 369
712 712
407 407
366 366
748 748
114 114
359 359
1083 1083
352 352
647 647
351 351
350 350
709 709
692 692
661 661
108 108
1099 1099
346 346
651 651
618 618
399 399
510 510
355 355
335 335
245 245
184 184
1036 1036
362 362
334 334
376 376
258 258
237 237
331 331
538 538
1027 1027
328 328
174 174
324 324
859 859
80 80
553 553
408 408
327 327
321 321
320 320
141 141
314 314
793 793
363 363
579 579
177 177
811 811
305 305
568 568
715 715
303 303
301 301
472 472
799 799
759 759
300 300
35 35
439 439
977 977
263 263
1096 1096
83 83
252 252
297 297
798 798
614 614
356 356
1092 1092
787 787
741 741
333 333
292 292
606 606
339 339
317 317
291 291
290 290
14 14
289 289
905 905
454 454
302 302
161 161
219 219
529 529
1016 1016
952 952
286 286
528 528
25 25
839 839
702 702
110 110
142 142
275 275
279 279
607 607
679 679
495 495
349 349
690 690
278 278
276 276
633 633
274 274
354 354
441 441
273 273
871 871
239 239
337 337
151 151
270 270
288 288
908 908
269 269
65 65
268 268
533 533
264 264
392 392
249 249
388 388
802 802
751 751
379 379
411 411
194 194
255 255
795 795
966 966
365 365
986 986
675 675
253 253
993 993
353 353
92 92
211 211
247 247
402 402
277 277
246 246
37 37
344 344
345 345
676 676
243 243
1037 1037
126 126
417 417
1081 1081
583 583
261 261
238 238
438 438
505 505
385 385
295 295
761 761
272 272
524 524
256 256
844 844
69 69
595 595
975 975
160 160
250 250
507 507
514 514
412 412
641 641
325 325
231 231
397 397
227 227
223 223
154 154
318 318
710 710
222 222
111 111
650 650
221 221
530 530
340 340
220 220
360 360
214 214
213 213
357 357
922 922
525 525
522 522
210 210
209 209
489 489
207 207
1095 1095
923 923
714 714
316 316
517 517
203 203
176 176
206 206
205 205
367 367
532 532
592 592
129 129
105 105
387 387
195 195
6 6
241 241
59 59
597 597
465 465
945 945
400 400
944 944
225 225
189 189
933 933
657 657
121 121
23 23
183 183
32 32
685 685
555 555
10 10
459 459
995 995
182 182
267 267
96 96
88 88
208 208
71 71
156 156
236 236
175 175
20 20
672 672
616 616
611 611
185 185
642 642
180 180
164 164
729 729
307 307
588 588
36 36
46 46
179 179
322 322
804 804
468 468
166 166
434 434
171 171
212 212
309 309
170 170
19 19
216 216
131 131
168 168
497 497
18 18
371 371
703 703
187 187
632 632
44 44
326 326
229 229
829 829
574 574
750 750
67 67
535 535
364 364
158 158
884 884
684 684
49 49
631 631
602 602
453 453
850 850
149 149
867 867
47 47
148 148
969 969
755 755
585 585
144 144
847 847
293 293
448 448
199 199
444 444
143 143
193 193
306 306
262 262
790 790
81 81
430 430
471 471
973 973
97 97
34 34
889 889
566 566
382 382
169 169
133 133
726 726
443 443
136 136
200 200
102 102
29 29
621 621
140 140
670 670
373 373
985 985
186 186
76 76
1029 1029
139 139
75 75
137 137
192 192
228 228
178 178
437 437
821 821
233 233
370 370
77 77
433 433
949 949
130 130
122 122
198 198
780 780
601 601
123 123
460 460
11 11
386 386
342 342
127 127
38 38
125 125
689 689
310 310
100 100
282 282
1003 1003
464 464
135 135
378 378
749 749
72 72
172 172
990 990
864 864
153 153
1002 1002
89 89
119 119
117 117
758 758
452 452
112 112
1001 1001
663 663
656 656
26 26
215 215
109 109
516 516
1085 1085
311 311
107 107
527 527
104 104
103 103
257 257
116 116
120 120
622 622
1102 1102
666 666
147 147
431 431
974 974
660 660
163 163
259 259
962 962
671 671
1069 1069
95 95
58 58
70 70
731 731
1012 1012
90 90
980 980
190 190
98 98
803 803
24 24
87 87
783 783
429 429
201 201
929 929
878 878
196 196
280 280
86 86
52 52
294 294
823 823
85 85
773 773
30 30
5 5
91 91
902 902
28 28
813 813
285 285
594 594
63 63
897 897
167 167
134 134
218 218
82 82
55 55
329 329
1039 1039
94 94
879 879
718 718
502 502
1045 1045
79 79
372 372
260 260
150 150
74 74
106 106
56 56
41 41
383 383
197 197
446 446
491 491
57 57
860 860
330 330
724 724
244 244
410 410
54 54
469 469
68 68
562 562
885 885
361 361
128 128
66 66
934 934
242 242
930 930
21 21
16 16
368 368
217 217
113 113
543 543
61 61
332 332
315 315
53 53
649 649
64 64
50 50
296 296
481 481
895 895
265 265
45 45
40 40
380 380
857 857
319 319
1013 1013
512 512
927 927
248 248
996 996
420 420
323 323
451 451
43 43
338 338
17 17
13 13
138 138
33 33
226 226
124 124
664 664
27 27
784 784
173 173
308 308
556 556
304 304
9 9
827 827
51 51
779 779
561 561
858 858
482 482
152 152
721 721
587 587
224 224
8 8
762 762
757 757
374 374
869 869
638 638
7 7
