<EOF> 0
<EOS> 1
<UNK> 2
<S> 3
</S> 4
7 6
20 7
40 8
6 9
26 10
29 11
21 12
35 13
33 14
9 15
65 16
212 17
15 18
254 19
93 20
129 21
103 22
44 23
228 24
562 25
22 26
42 27
28 28
100 29
13 30
181 31
99 32
559 33
166 34
109 35
461 36
120 37
240 38
47 39
23 40
144 41
108 42
619 43
582 44
43 45
276 46
165 47
163 48
12 49
77 50
174 51
74 52
64 53
388 54
119 55
81 56
546 57
452 58
98 59
407 60
382 61
332 62
316 63
299 64
154 65
399 66
357 67
348 68
158 69
137 70
92 71
68 72
124 73
105 74
94 75
53 76
436 77
406 78
191 79
167 80
135 81
115 82
61 83
544 84
457 85
273 86
258 87
175 88
148 89
123 90
79 91
539 92
503 93
427 94
418 95
321 96
32 97
314 98
308 99
305 100
117 101
958 102
628 103
580 104
545 105
270 106
233 107
232 108
229 109
226 110
222 111
211 112
180 113
949 114
747 115
668 116
659 117
631 118
579 119
561 120
515 121
493 122
375 123
368 124
361 125
340 126
279 127
27 128
260 129
24 130
223 131
138 132
126 133
973 134
952 135
950 136
95 137
948 138
849 139
80 140
720 141
72 142
71 143
708 144
67 145
666 146
641 147
572 148
571 149
570 150
567 151
566 152
560 153
553 154
54 155
52 156
499 157
410 158
371 159
365 160
329 161
320 162
315 163
304 164
302 165
265 166
234 167
189 168
102 169
923 170
816 171
814 172
784 173
773 174
767 175
753 176
736 177
719 178
682 179
646 180
602 181
599 182
587 183
583 184
581 185
573 186
564 187
563 188
532 189
519 190
507 191
476 192
475 193
455 194
433 195
363 196
353 197
352 198
331 199
323 200
301 201
297 202
271 203
269 204
263 205
25 206
215 207
208 208
206 209
200 210
184 211
169 212
153 213
127 214
113 215
101 216
957 217
929 218
921 219
883 220
872 221
867 222
855 223
85 224
831 225
812 226
811 227
810 228
797 229
796 230
783 231
78 232
76 233
740 234
711 235
698 236
697 237
69 238
680 239
662 240
661 241
640 242
639 243
638 244
636 245
63 246
627 247
610 248
609 249
605 250
601 251
593 252
591 253
569 254
554 255
552 256
55 257
518 258
514 259
511 260
510 261
506 262
505 263
502 264
497 265
469 266
468 267
465 268
449 269
445 270
431 271
429 272
425 273
415 274
414 275
409 276
402 277
400 278
39 279
389 280
385 281
373 282
34 283
328 284
31 285
295 286
277 287
267 288
264 289
241 290
238 291
217 292
19 293
187 294
182 295
179 296
177 297
155 298
145 299
139 300
132 301
114 302
977 303
965 304
964 305
963 306
962 307
961 308
960 309
954 310
941 311
932 312
930 313
928 314
925 315
920 316
906 317
903 318
897 319
893 320
89 321
881 322
88 323
878 324
877 325
876 326
870 327
868 328
854 329
845 330
84 331
834 332
83 333
824 334
823 335
813 336
805 337
800 338
8 339
794 340
787 341
779 342
768 343
763 344
754 345
750 346
748 347
742 348
735 349
734 350
733 351
731 352
730 353
729 354
727 355
725 356
721 357
716 358
705 359
704 360
703 361
692 362
688 363
686 364
685 365
683 366
681 367
678 368
675 369
665 370
663 371
66 372
653 373
652 374
651 375
650 376
643 377
635 378
622 379
617 380
607 381
606 382
600 383
589 384
588 385
585 386
578 387
574 388
568 389
565 390
558 391
556 392
555 393
551 394
548 395
536 396
530 397
521 398
516 399
509 400
508 401
501 402
496 403
485 404
484 405
479 406
478 407
472 408
470 409
467 410
458 411
456 412
451 413
443 414
441 415
435 416
430 417
420 418
419 419
417 420
416 421
413 422
41 423
408 424
405 425
398 426
392 427
391 428
390 429
378 430
376 431
372 432
370 433
364 434
360 435
359 436
358 437
351 438
346 439
342 440
338 441
337 442
333 443
326 444
322 445
318 446
317 447
313 448
312 449
307 450
286 451
256 452
255 453
247 454
245 455
242 456
236 457
225 458
214 459
210 460
209 461
202 462
199 463
196 464
194 465
188 466
178 467
172 468
170 469
161 470
159 471
156 472
152 473
146 474
143 475
136 476
130 477
1082 478
107 479
106 480
1059 481
1040 482
104 483
1014 484
1012 485
999 486
998 487
997 488
996 489
995 490
994 491
993 492
992 493
991 494
990 495
989 496
988 497
987 498
986 499
985 500
984 501
983 502
982 503
981 504
980 505
979 506
978 507
976 508
975 509
974 510
972 511
971 512
970 513
97 514
969 515
968 516
967 517
966 518
96 519
959 520
956 521
955 522
953 523
951 524
947 525
946 526
945 527
944 528
943 529
942 530
940 531
939 532
938 533
937 534
936 535
935 536
934 537
933 538
931 539
927 540
926 541
924 542
922 543
919 544
918 545
917 546
916 547
915 548
914 549
913 550
912 551
911 552
910 553
91 554
909 555
908 556
907 557
905 558
904 559
902 560
901 561
900 562
90 563
899 564
898 565
896 566
895 567
894 568
892 569
891 570
890 571
889 572
888 573
887 574
886 575
885 576
884 577
882 578
880 579
879 580
875 581
874 582
873 583
871 584
87 585
869 586
866 587
865 588
864 589
863 590
862 591
861 592
860 593
86 594
859 595
858 596
857 597
856 598
853 599
852 600
851 601
850 602
848 603
847 604
846 605
844 606
843 607
842 608
841 609
840 610
839 611
838 612
837 613
836 614
835 615
833 616
832 617
830 618
829 619
828 620
827 621
826 622
825 623
822 624
821 625
820 626
82 627
819 628
818 629
817 630
815 631
809 632
808 633
807 634
806 635
804 636
803 637
802 638
801 639
799 640
798 641
795 642
793 643
792 644
791 645
790 646
789 647
788 648
786 649
785 650
782 651
781 652
780 653
778 654
777 655
776 656
775 657
774 658
772 659
771 660
770 661
769 662
766 663
765 664
764 665
762 666
761 667
760 668
759 669
758 670
757 671
756 672
755 673
752 674
751 675
75 676
749 677
746 678
745 679
744 680
743 681
741 682
739 683
738 684
737 685
732 686
73 687
728 688
726 689
724 690
723 691
722 692
718 693
717 694
715 695
714 696
713 697
712 698
710 699
709 700
707 701
706 702
702 703
701 704
700 705
70 706
699 707
696 708
695 709
694 710
693 711
691 712
690 713
689 714
687 715
684 716
679 717
677 718
676 719
674 720
673 721
672 722
671 723
670 724
669 725
667 726
664 727
660 728
658 729
657 730
656 731
655 732
654 733
649 734
648 735
647 736
645 737
644 738
642 739
637 740
634 741
633 742
632 743
630 744
629 745
626 746
625 747
624 748
623 749
621 750
620 751
62 752
618 753
616 754
615 755
614 756
613 757
612 758
611 759
608 760
604 761
603 762
60 763
598 764
597 765
596 766
595 767
594 768
592 769
590 770
59 771
586 772
584 773
58 774
577 775
576 776
575 777
57 778
56 779
557 780
550 781
549 782
547 783
543 784
542 785
541 786
540 787
538 788
537 789
535 790
534 791
533 792
531 793
529 794
528 795
527 796
526 797
525 798
524 799
523 800
522 801
520 802
517 803
513 804
512 805
51 806
504 807
500 808
50 809
5 810
498 811
495 812
494 813
492 814
491 815
490 816
49 817
489 818
488 819
487 820
486 821
483 822
482 823
481 824
480 825
48 826
477 827
474 828
473 829
471 830
466 831
464 832
463 833
462 834
460 835
46 836
459 837
454 838
453 839
450 840
45 841
448 842
447 843
446 844
444 845
442 846
440 847
439 848
438 849
437 850
434 851
432 852
428 853
426 854
424 855
423 856
422 857
421 858
412 859
411 860
404 861
403 862
401 863
397 864
396 865
395 866
394 867
393 868
387 869
386 870
384 871
383 872
381 873
380 874
38 875
379 876
377 877
374 878
37 879
369 880
367 881
366 882
362 883
36 884
356 885
355 886
354 887
350 888
349 889
347 890
345 891
344 892
343 893
341 894
339 895
336 896
335 897
334 898
330 899
327 900
325 901
324 902
319 903
311 904
310 905
309 906
306 907
303 908
300 909
30 910
298 911
296 912
294 913
293 914
292 915
291 916
290 917
289 918
288 919
287 920
285 921
284 922
283 923
282 924
281 925
280 926
278 927
275 928
274 929
272 930
268 931
266 932
262 933
261 934
259 935
257 936
253 937
252 938
251 939
250 940
249 941
248 942
246 943
244 944
243 945
239 946
237 947
235 948
231 949
230 950
227 951
224 952
221 953
220 954
219 955
218 956
216 957
213 958
207 959
205 960
204 961
203 962
201 963
198 964
197 965
195 966
193 967
192 968
190 969
186 970
185 971
183 972
18 973
176 974
173 975
171 976
17 977
168 978
164 979
162 980
160 981
16 982
157 983
151 984
150 985
149 986
147 987
142 988
141 989
140 990
14 991
134 992
133 993
131 994
128 995
125 996
122 997
121 998
118 999
116 1000
112 1001
111 1002
1109 1003
1108 1004
1107 1005
1106 1006
1105 1007
1104 1008
1103 1009
1102 1010
1101 1011
1100 1012
110 1013
11 1014
1099 1015
1098 1016
1097 1017
1096 1018
1095 1019
1094 1020
1093 1021
1092 1022
1091 1023
1090 1024
1089 1025
1088 1026
1087 1027
1086 1028
1085 1029
1084 1030
1083 1031
1081 1032
1080 1033
1079 1034
1078 1035
1077 1036
1076 1037
1075 1038
1074 1039
1073 1040
1072 1041
1071 1042
1070 1043
1069 1044
1068 1045
1067 1046
1066 1047
1065 1048
1064 1049
1063 1050
1062 1051
1061 1052
1060 1053
1058 1054
1057 1055
1056 1056
1055 1057
1054 1058
1053 1059
1052 1060
1051 1061
1050 1062
1049 1063
1048 1064
1047 1065
1046 1066
1045 1067
1044 1068
1043 1069
1042 1070
1041 1071
1039 1072
1038 1073
1037 1074
1036 1075
1035 1076
1034 1077
1033 1078
1032 1079
1031 1080
1030 1081
1029 1082
1028 1083
1027 1084
1026 1085
1025 1086
1024 1087
1023 1088
1022 1089
1021 1090
1020 1091
1019 1092
1018 1093
1017 1094
1016 1095
1015 1096
1013 1097
1011 1098
1010 1099
1009 1100
1008 1101
1007 1102
1006 1103
1005 1104
1004 1105
1003 1106
1002 1107
1001 1108
1000 1109
10 1110
